In [28]:
import numpy as np
import pandas as pd

In [29]:
np.nan

nan

In [30]:
pd.NA

In [31]:
df = pd.read_csv('..\\Datasets\\movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [32]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [33]:
# Filter the DataFrame to include rows where 'pre_movie_score' is null and 'first_name' is not null
df[(df['pre_movie_score'].isnull()) & (df['first_name'].notnull())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [34]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [35]:
df.dropna(thresh=1)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [36]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [37]:
df.fillna('Empty Val')

  first_name  last_name        age        sex pre_movie_score post_movie_score
0        Tom      Hanks       63.0          m             8.0             10.0
1  Empty Val  Empty Val  Empty Val  Empty Val       Empty Val        Empty Val
2       Hugh    Jackman       51.0          m       Empty Val        Empty Val
3      Oprah    Winfrey       66.0          f             6.0              8.0
4       Emma      Stone       31.0          f             7.0              9.0

In [38]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [47]:
df['pre_movie_score'] = df['pre_movie_score'].fillna(0)

In [48]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m                0              10.0
1        NaN       NaN   NaN  NaN                0               NaN
2       Hugh   Jackman  51.0    m                0               NaN
3      Oprah   Winfrey  66.0    f                0               8.0
4       Emma     Stone  31.0    f                0               9.0

In [49]:
df['pre_movie_score'].replace(
    to_replace=0.0, value=df['pre_movie_score'].mean())

0    0
1    0
2    0
3    0
4    0
Name: pre_movie_score, dtype: int64

In [50]:
netflix = {'Free': 7, 'Basic': 10, 'Standard': np.nan, 'Premium': 20}

In [51]:
ser = pd.Series(netflix)
ser

In [53]:
ser.interpolate()

Free         7.0
Basic       10.0
Standard    15.0
Premium     20.0
dtype: float64